BEGIN;

TRUNCATE TABLE lessons RESTART IDENTITY CASCADE;
TRUNCATE TABLE student_group RESTART IDENTITY CASCADE;
TRUNCATE TABLE subjects RESTART IDENTITY CASCADE;
TRUNCATE TABLE teachers RESTART IDENTITY CASCADE;
TRUNCATE TABLE classrooms RESTART IDENTITY CASCADE;

INSERT INTO classrooms (id, name) VALUES (1, '101 (Лекц.)'), (2, '202 (Мат.)'), (3, '304А (Комп.)'), (4, 'Лаб. ИИ'), (5, 'Лаб. Сетей'), (6, '405 (Каф.)'), (7, 'Спортивный зал');
INSERT INTO teachers (id, department, full_name) VALUES (1, 'ИТ', 'Иванов Иван Иванович'), (2, 'ПО', 'Петров Петр Петрович'), (3, 'ПО', 'Сидорова Анна Владимировна'), (4, 'ВМ', 'Кузнецов Алексей Сергеевич'), (5, 'ИБ', 'Васильев Игорь Николаевич'), (6, 'Фил.', 'Морозова Елена Павловна'), (7, 'Физ.', 'Борисов Олег Артемович');
INSERT INTO subjects (id, name) VALUES (1, 'Алгоритмы'), (2, 'Базы данных'), (3, 'ОС'), (4, 'Сети'), (5, 'Архитектура ЭВМ'), (6, 'Дискретная мат.'), (7, 'Теория алгоритмов'), (8, 'Разработка ПО'), (9, 'ИнфоБезопасность'), (10, 'Философия'), (11, 'Физкультура'), (12, 'ООП');
INSERT INTO student_group (id, course, name) VALUES (1, 1, 'ПИ-11'), (2, 1, 'ПИ-12'), (3, 2, 'ПИ-21'), (4, 2, 'ИС-22'), (5, 3, 'ПИ-31'), (6, 3, 'ИС-31'), (7, 4, 'ПИ-41'), (8, 5, 'ПИ-51');

INSERT INTO lessons (lesson_date, day_of_week, start_time, end_time, lesson_type, classroom_id, group_id, subject_id, teacher_id)
VALUES
-- ПОНЕДЕЛЬНИК
('2026-01-26','MONDAY','09:00','10:30','Лекция',1,1,6,4),
('2026-01-26','MONDAY','10:40','12:10','Практика',2,1,6,4),
('2026-01-26','MONDAY','12:40','14:10','Практика',3,1,1,1),
('2026-01-26','MONDAY','09:00','10:30','Практика',3,2,1,1),
('2026-01-26','MONDAY','10:40','12:10','Лекция',1,2,1,1),
('2026-01-26','MONDAY','12:40','14:10','Лекция',2,2,6,4),
('2026-01-26','MONDAY','12:40','14:10','Лекция',1,3,10,6),
('2026-01-26','MONDAY','14:20','15:50','Практика',6,3,1,1),
('2026-01-26','MONDAY','16:00','17:30','Лаб. работа',3,3,2,2),
('2026-01-26','MONDAY','09:00','10:30','Лекция',6,4,9,5),
('2026-01-26','MONDAY','10:40','12:10','Практика',4,4,9,5),
('2026-01-26','MONDAY','14:20','15:50','Лекция',1,4,10,6),
('2026-01-26','MONDAY','09:00','10:30','Лекция',6,5,8,3),
('2026-01-26','MONDAY','10:40','12:10','Лаб. работа',3,5,8,3),
('2026-01-26','MONDAY','14:20','15:50','Лекция',2,6,4,5),
('2026-01-26','MONDAY','16:00','17:30','Практика',5,6,4,5),
('2026-01-26','MONDAY','12:40','14:10','Лекция',6,7,8,3),
('2026-01-26','MONDAY','14:20','15:50','Лаб. работа',4,7,8,3),
('2026-01-26','MONDAY','09:00','10:30','Лекция',2,8,12,2),
('2026-01-26','MONDAY','10:40','12:10','Семинар',6,8,12,2),

-- ВТОРНИК
('2026-01-27','TUESDAY','14:20','15:50','Лекция',1,1,10,6),
('2026-01-27','TUESDAY','16:00','17:30','Семинар',6,1,10,6),
('2026-01-27','TUESDAY','09:00','10:30','Лекция',1,2,10,6),
('2026-01-27','TUESDAY','10:40','12:10','Практика',2,2,1,1),
('2026-01-27','TUESDAY','12:40','14:10','Практика',7,2,11,7),
('2026-01-27','TUESDAY','09:00','10:30','Лекция',1,3,2,2),
('2026-01-27','TUESDAY','10:40','12:10','Лаб. работа',4,3,2,2),
('2026-01-27','TUESDAY','12:40','14:10','Практика',7,3,11,7),
('2026-01-27','TUESDAY','09:00','10:30','Лекция',2,4,2,2),
('2026-01-27','TUESDAY','10:40','12:10','Практика',2,4,2,2),
('2026-01-27','TUESDAY','14:20','15:50','Практика',7,4,11,7),
('2026-01-27','TUESDAY','12:40','14:10','Лекция',1,5,4,5),
('2026-01-27','TUESDAY','14:20','15:50','Лаб. работа',5,5,4,5),
('2026-01-27','TUESDAY','16:00','17:30','Практика',7,5,11,7),
('2026-01-27','TUESDAY','09:00','10:30','Лекция',6,6,9,5),
('2026-01-27','TUESDAY','10:40','12:10','Лаб. работа',4,6,9,5),
('2026-01-27','TUESDAY','12:40','14:10','Лекция',2,6,3,3),
('2026-01-27','TUESDAY','09:00','10:30','Лекция',1,7,12,2),
('2026-01-27','TUESDAY','10:40','12:10','Практика',3,7,12,2),
('2026-01-27','TUESDAY','14:20','15:50','Лекция',6,8,9,5),
('2026-01-27','TUESDAY','16:00','17:30','Практика',4,8,9,5),

-- СРЕДА
('2026-01-28','WEDNESDAY','09:00','10:30','Лекция',1,1,1,1),
('2026-01-28','WEDNESDAY','10:40','12:10','Практика',3,1,6,4),
('2026-01-28','WEDNESDAY','14:20','15:50','Лекция',2,1,5,1),
('2026-01-28','WEDNESDAY','09:00','10:30','Практика',7,2,11,7),
('2026-01-28','WEDNESDAY','10:40','12:10','Лекция',1,2,10,6),
('2026-01-28','WEDNESDAY','12:40','14:10','Практика',2,2,6,4),
('2026-01-28','WEDNESDAY','12:40','14:10','Лаб. работа',5,3,4,5),
('2026-01-28','WEDNESDAY','14:20','15:50','Практика',2,3,6,4),
('2026-01-28','WEDNESDAY','09:00','10:30','Лекция',2,4,4,5),
('2026-01-28','WEDNESDAY','10:40','12:10','Лаб. работа',5,4,4,5),
('2026-01-28','WEDNESDAY','12:40','14:10','Практика',3,4,3,3),
('2026-01-28','WEDNESDAY','09:00','10:30','Лекция',1,5,9,5),
('2026-01-28','WEDNESDAY','10:40','12:10','Практика',4,5,9,5),
('2026-01-28','WEDNESDAY','10:40','12:10','Лекция',6,6,9,5),
('2026-01-28','WEDNESDAY','12:40','14:10','Лаб. работа',4,6,9,5),
('2026-01-28','WEDNESDAY','14:20','15:50','Лаб. работа',5,6,4,5),
('2026-01-28','WEDNESDAY','12:40','14:10','Лекция',1,7,9,5),
('2026-01-28','WEDNESDAY','14:20','15:50','Практика',4,7,9,5),
('2026-01-28','WEDNESDAY','16:00','17:30','Практика',7,7,11,7),
('2026-01-28','WEDNESDAY','09:00','10:30','Лекция',6,8,8,3),
('2026-01-28','WEDNESDAY','10:40','12:10','Семинар',6,8,8,3),

-- ЧЕТВЕРГ
('2026-01-29','THURSDAY','09:00','10:30','Практика',2,1,5,1),
('2026-01-29','THURSDAY','10:40','12:10','Лаб. работа',3,1,1,1),
('2026-01-29','THURSDAY','09:00','10:30','Лекция',1,2,5,1),
('2026-01-29','THURSDAY','10:40','12:10','Практика',3,2,5,1),
('2026-01-29','THURSDAY','12:40','14:10','Семинар',6,2,10,6),
('2026-01-29','THURSDAY','09:00','10:30','Лекция',1,3,9,5),
('2026-01-29','THURSDAY','10:40','12:10','Практика',3,3,9,5),
('2026-01-29','THURSDAY','14:20','15:50','Лекция',2,3,3,3),
('2026-01-29','THURSDAY','12:40','14:10','Лекция',1,4,3,3),
('2026-01-29','THURSDAY','14:20','15:50','Лаб. работа',4,4,3,3),
('2026-01-29','THURSDAY','16:00','17:30','Семинар',6,4,10,6),
('2026-01-29','THURSDAY','09:00','10:30','Лекция',2,5,12,2),
('2026-01-29','THURSDAY','10:40','12:10','Лаб. работа',3,5,12,2),
('2026-01-29','THURSDAY','09:00','10:30','Лекция',1,6,8,3),
('2026-01-29','THURSDAY','10:40','12:10','Практика',3,6,8,3),
('2026-01-29','THURSDAY','12:40','14:10','Лаб. работа',4,6,3,3),
('2026-01-29','THURSDAY','09:00','10:30','Лекция',6,7,12,2),
('2026-01-29','THURSDAY','10:40','12:10','Практика',3,7,12,2),
('2026-01-29','THURSDAY','12:40','14:10','Лаб. работа',4,7,8,3),
('2026-01-29','THURSDAY','16:00','17:30','Лекция',1,8,8,3),
('2026-01-29','THURSDAY','17:40','19:10','Семинар',6,8,8,3),

-- ПЯТНИЦА
('2026-01-30','FRIDAY','12:40','14:10','Практика',7,1,11,7),
('2026-01-30','FRIDAY','09:00','10:30','Лекция',1,2,5,1),
('2026-01-30','FRIDAY','10:40','12:10','Практика',2,2,5,1),
('2026-01-30','FRIDAY','09:00','10:30','Практика',2,3,7,4),
('2026-01-30','FRIDAY','10:40','12:10','Лекция',1,3,5,1),
('2026-01-30','FRIDAY','12:40','14:10','Практика',3,3,3,3),
('2026-01-30','FRIDAY','09:00','10:30','Лекция',6,4,5,1),
('2026-01-30','FRIDAY','10:40','12:10','Практика',3,4,5,1),
('2026-01-30','FRIDAY','14:20','15:50','Лекция',1,5,12,2),
('2026-01-30','FRIDAY','16:00','17:30','Лаб. работа',4,5,12,2),
('2026-01-30','FRIDAY','09:00','10:30','Практика',7,6,11,7),
('2026-01-30','FRIDAY','12:40','14:10','Семинар',6,6,8,3),
('2026-01-30','FRIDAY','14:20','15:50','Практика',7,7,11,7),
('2026-01-30','FRIDAY','16:00','17:30','Семинар',6,7,9,5),
('2026-01-30','FRIDAY','12:40','14:10','Лекция',2,8,4,5),
('2026-01-30','FRIDAY','14:20','15:50','Практика',5,8,4,5);

SELECT setval('classrooms_id_seq', (SELECT MAX(id) FROM classrooms));
SELECT setval('teachers_id_seq', (SELECT MAX(id) FROM teachers));
SELECT setval('subjects_id_seq', (SELECT MAX(id) FROM subjects));
SELECT setval('student_group_id_seq', (SELECT MAX(id) FROM student_group));
SELECT setval('lessons_id_seq', (SELECT MAX(id) FROM lessons));

COMMIT;


--ROLLBACK;