BEGIN;

TRUNCATE TABLE lessons RESTART IDENTITY CASCADE;
TRUNCATE TABLE student_group RESTART IDENTITY CASCADE;
TRUNCATE TABLE subjects RESTART IDENTITY CASCADE;
TRUNCATE TABLE teachers RESTART IDENTITY CASCADE;
TRUNCATE TABLE classrooms RESTART IDENTITY CASCADE;

-- 1. АУДИТОРИИ
INSERT INTO classrooms (id, name) VALUES
                                      (1, '101 (Лекц.)'), (2, '202 (Мат.)'), (3, '304А (Комп.)'),
                                      (4, 'Лаб. ИИ'), (5, 'Лаб. Сетей'), (6, '405 (Каф.)'), (7, 'Спортивный зал');

-- 2. ПРЕПОДАВАТЕЛИ
INSERT INTO teachers (id, department, full_name) VALUES
                                                     (1, 'ИТ', 'Иванов Иван Иванович'), (2, 'ПО', 'Петров Петр Петрович'),
                                                     (3, 'ПО', 'Сидорова Анна Владимировна'), (4, 'ВМ', 'Кузнецов Алексей Сергеевич'),
                                                     (5, 'ИБ', 'Васильев Игорь Николаевич'), (6, 'Фил.', 'Морозова Елена Павловна'),
                                                     (7, 'Физ.', 'Борисов Олег Артемович');

-- 3. ПРЕДМЕТЫ
INSERT INTO subjects (id, name) VALUES
                                    (1, 'Алгоритмы'), (2, 'Базы данных'), (3, 'ОС'), (4, 'Сети'), (5, 'Архитектура ЭВМ'),
                                    (6, 'Дискретная мат.'), (7, 'Теория алгоритмов'), (8, 'Разработка ПО'),
                                    (9, 'ИнфоБезопасность'), (10, 'Философия'), (11, 'Физкультура'), (12, 'ООП');

-- 4. ГРУППЫ (1-ПИ11, 2-ПИ12, 3-ПИ21, 4-ИС22, 5-ПИ31, 6-ИС31, 7-ПИ41, 8-ПИ51)
INSERT INTO student_group (id, course, name) VALUES
                                                 (1, 1, 'ПИ-11'), (2, 1, 'ПИ-12'), (3, 2, 'ПИ-21'), (4, 2, 'ИС-22'),
                                                 (5, 3, 'ПИ-31'), (6, 3, 'ИС-31'), (7, 4, 'ПИ-41'), (8, 5, 'ПИ-51');

-- 5. РАСПИСАНИЕ
INSERT INTO lessons (day_of_week, start_time, end_time, lesson_type, classroom_id, group_id, subject_id, teacher_id)
VALUES
-- ================ ПОНЕДЕЛЬНИК ================
-- ПИ-11 (1 курс)
('MONDAY', '09:00', '10:30', 'Лекция', 1, 1, 6, 4),
('MONDAY', '10:40', '12:10', 'Практика', 2, 1, 6, 4),
('MONDAY', '12:40', '14:10', 'Практика', 3, 1, 1, 1),

-- ПИ-12 (1 курс)
('MONDAY', '09:00', '10:30', 'Практика', 3, 2, 1, 1),
('MONDAY', '10:40', '12:10', 'Лекция', 1, 2, 1, 1),
('MONDAY', '12:40', '14:10', 'Лекция', 2, 2, 6, 4),

-- ПИ-21 (2 курс)
('MONDAY', '12:40', '14:10', 'Лекция', 1, 3, 10, 6),
('MONDAY', '14:20', '15:50', 'Практика', 6, 3, 1, 1),
('MONDAY', '16:00', '17:30', 'Лаб. работа', 3, 3, 2, 2),

-- ИС-22 (2 курс)
('MONDAY', '09:00', '10:30', 'Лекция', 6, 4, 9, 5),
('MONDAY', '10:40', '12:10', 'Практика', 4, 4, 9, 5),
('MONDAY', '14:20', '15:50', 'Лекция', 1, 4, 10, 6),

-- ПИ-31 (3 курс)
('MONDAY', '09:00', '10:30', 'Лекция', 6, 5, 8, 3),
('MONDAY', '10:40', '12:10', 'Лаб. работа', 3, 5, 8, 3),

-- ИС-31 (3 курс)
('MONDAY', '14:20', '15:50', 'Лекция', 2, 6, 4, 5),
('MONDAY', '16:00', '17:30', 'Практика', 5, 6, 4, 5),

-- ПИ-41 (4 курс)
('MONDAY', '12:40', '14:10', 'Лекция', 6, 7, 8, 3),
('MONDAY', '14:20', '15:50', 'Лаб. работа', 4, 7, 8, 3),

-- ПИ-51 (5 курс)
('MONDAY', '09:00', '10:30', 'Лекция', 2, 8, 12, 2),
('MONDAY', '10:40', '12:10', 'Семинар', 6, 8, 12, 2),

-- ================ ВТОРНИК ================
-- ПИ-11 (1 курс)
('TUESDAY', '14:20', '15:50', 'Лекция', 1, 1, 10, 6),
('TUESDAY', '16:00', '17:30', 'Семинар', 6, 1, 10, 6),

-- ПИ-12 (1 курс)
('TUESDAY', '09:00', '10:30', 'Лекция', 1, 2, 10, 6),
('TUESDAY', '10:40', '12:10', 'Практика', 2, 2, 1, 1),
('TUESDAY', '12:40', '14:10', 'Практика', 7, 2, 11, 7),

-- ПИ-21 (2 курс)
('TUESDAY', '09:00', '10:30', 'Лекция', 1, 3, 2, 2),
('TUESDAY', '10:40', '12:10', 'Лаб. работа', 4, 3, 2, 2),
('TUESDAY', '12:40', '14:10', 'Практика', 7, 3, 11, 7),

-- ИС-22 (2 курс)
('TUESDAY', '09:00', '10:30', 'Лекция', 2, 4, 2, 2),
('TUESDAY', '10:40', '12:10', 'Практика', 2, 4, 2, 2),
('TUESDAY', '14:20', '15:50', 'Практика', 7, 4, 11, 7),

-- ПИ-31 (3 курс)
('TUESDAY', '12:40', '14:10', 'Лекция', 1, 5, 4, 5),
('TUESDAY', '14:20', '15:50', 'Лаб. работа', 5, 5, 4, 5),
('TUESDAY', '16:00', '17:30', 'Практика', 7, 5, 11, 7),

-- ИС-31 (3 курс)
('TUESDAY', '09:00', '10:30', 'Лекция', 6, 6, 9, 5),
('TUESDAY', '10:40', '12:10', 'Лаб. работа', 4, 6, 9, 5),
('TUESDAY', '12:40', '14:10', 'Лекция', 2, 6, 3, 3),

-- ПИ-41 (4 курс)
('TUESDAY', '09:00', '10:30', 'Лекция', 1, 7, 12, 2),
('TUESDAY', '10:40', '12:10', 'Практика', 3, 7, 12, 2),

-- ПИ-51 (5 курс)
('TUESDAY', '14:20', '15:50', 'Лекция', 6, 8, 9, 5),
('TUESDAY', '16:00', '17:30', 'Практика', 4, 8, 9, 5),

-- ================ СРЕДА ================
-- ПИ-11 (1 курс)
('WEDNESDAY', '09:00', '10:30', 'Лекция', 1, 1, 1, 1),
('WEDNESDAY', '10:40', '12:10', 'Практика', 3, 1, 6, 4),
('WEDNESDAY', '14:20', '15:50', 'Лекция', 2, 1, 5, 1),

-- ПИ-12 (1 курс)
('WEDNESDAY', '09:00', '10:30', 'Практика', 7, 2, 11, 7),
('WEDNESDAY', '10:40', '12:10', 'Лекция', 1, 2, 10, 6),
('WEDNESDAY', '12:40', '14:10', 'Практика', 2, 2, 6, 4),

-- ПИ-21 (2 курс)
('WEDNESDAY', '12:40', '14:10', 'Лаб. работа', 5, 3, 4, 5),
('WEDNESDAY', '14:20', '15:50', 'Практика', 2, 3, 6, 4),

-- ИС-22 (2 курс)
('WEDNESDAY', '09:00', '10:30', 'Лекция', 2, 4, 4, 5),
('WEDNESDAY', '10:40', '12:10', 'Лаб. работа', 5, 4, 4, 5),
('WEDNESDAY', '12:40', '14:10', 'Практика', 3, 4, 3, 3),

-- ПИ-31 (3 курс)
('WEDNESDAY', '09:00', '10:30', 'Лекция', 1, 5, 9, 5),
('WEDNESDAY', '10:40', '12:10', 'Практика', 4, 5, 9, 5),

-- ИС-31 (3 курс)
('WEDNESDAY', '10:40', '12:10', 'Лекция', 6, 6, 9, 5),
('WEDNESDAY', '12:40', '14:10', 'Лаб. работа', 4, 6, 9, 5),
('WEDNESDAY', '14:20', '15:50', 'Лаб. работа', 5, 6, 4, 5),

-- ПИ-41 (4 курс)
('WEDNESDAY', '12:40', '14:10', 'Лекция', 1, 7, 9, 5),
('WEDNESDAY', '14:20', '15:50', 'Практика', 4, 7, 9, 5),
('WEDNESDAY', '16:00', '17:30', 'Практика', 7, 7, 11, 7),

-- ПИ-51 (5 курс)
('WEDNESDAY', '09:00', '10:30', 'Лекция', 6, 8, 8, 3),
('WEDNESDAY', '10:40', '12:10', 'Семинар', 6, 8, 8, 3),

-- ================ ЧЕТВЕРГ ================
-- ПИ-11 (1 курс)
('THURSDAY', '09:00', '10:30', 'Практика', 2, 1, 5, 1),
('THURSDAY', '10:40', '12:10', 'Лаб. работа', 3, 1, 1, 1),

-- ПИ-12 (1 курс)
('THURSDAY', '09:00', '10:30', 'Лекция', 1, 2, 5, 1),
('THURSDAY', '10:40', '12:10', 'Практика', 3, 2, 5, 1),
('THURSDAY', '12:40', '14:10', 'Семинар', 6, 2, 10, 6),

-- ПИ-21 (2 курс)
('THURSDAY', '09:00', '10:30', 'Лекция', 1, 3, 9, 5),
('THURSDAY', '10:40', '12:10', 'Практика', 3, 3, 9, 5),
('THURSDAY', '14:20', '15:50', 'Лекция', 2, 3, 3, 3),

-- ИС-22 (2 курс)
('THURSDAY', '12:40', '14:10', 'Лекция', 1, 4, 3, 3),
('THURSDAY', '14:20', '15:50', 'Лаб. работа', 4, 4, 3, 3),
('THURSDAY', '16:00', '17:30', 'Семинар', 6, 4, 10, 6),

-- ПИ-31 (3 курс)
('THURSDAY', '09:00', '10:30', 'Лекция', 2, 5, 12, 2),
('THURSDAY', '10:40', '12:10', 'Лаб. работа', 3, 5, 12, 2),

-- ИС-31 (3 курс)
('THURSDAY', '09:00', '10:30', 'Лекция', 1, 6, 8, 3),
('THURSDAY', '10:40', '12:10', 'Практика', 3, 6, 8, 3),
('THURSDAY', '12:40', '14:10', 'Лаб. работа', 4, 6, 3, 3),

-- ПИ-41 (4 курс)
('THURSDAY', '09:00', '10:30', 'Лекция', 6, 7, 12, 2),
('THURSDAY', '10:40', '12:10', 'Практика', 3, 7, 12, 2),
('THURSDAY', '12:40', '14:10', 'Лаб. работа', 4, 7, 8, 3),

-- ПИ-51 (5 курс)
('THURSDAY', '16:00', '17:30', 'Лекция', 1, 8, 8, 3),
('THURSDAY', '17:40', '19:10', 'Семинар', 6, 8, 8, 3),

-- ================ ПЯТНИЦА ================
-- ПИ-11 (1 курс)
('FRIDAY', '12:40', '14:10', 'Практика', 7, 1, 11, 7),

-- ПИ-12 (1 курс)
('FRIDAY', '09:00', '10:30', 'Лекция', 1, 2, 5, 1),
('FRIDAY', '10:40', '12:10', 'Практика', 2, 2, 5, 1),

-- ПИ-21 (2 курс)
('FRIDAY', '09:00', '10:30', 'Практика', 2, 3, 7, 4),
('FRIDAY', '10:40', '12:10', 'Лекция', 1, 3, 5, 1),
('FRIDAY', '12:40', '14:10', 'Практика', 3, 3, 3, 3),

-- ИС-22 (2 курс)
('FRIDAY', '09:00', '10:30', 'Лекция', 6, 4, 5, 1),
('FRIDAY', '10:40', '12:10', 'Практика', 3, 4, 5, 1),

-- ПИ-31 (3 курс)
('FRIDAY', '14:20', '15:50', 'Лекция', 1, 5, 12, 2),
('FRIDAY', '16:00', '17:30', 'Лаб. работа', 4, 5, 12, 2),

-- ИС-31 (3 курс)
('FRIDAY', '09:00', '10:30', 'Практика', 7, 6, 11, 7),
('FRIDAY', '12:40', '14:10', 'Семинар', 6, 6, 8, 3),

-- ПИ-41 (4 курс)
('FRIDAY', '14:20', '15:50', 'Практика', 7, 7, 11, 7),
('FRIDAY', '16:00', '17:30', 'Семинар', 6, 7, 9, 5),

-- ПИ-51 (5 курс)
('FRIDAY', '12:40', '14:10', 'Лекция', 2, 8, 4, 5),
('FRIDAY', '14:20', '15:50', 'Практика', 5, 8, 4, 5);

-- 6. СБРОС СЕКВЕНЦИЙ
SELECT setval('classrooms_id_seq', (SELECT MAX(id) FROM classrooms));
SELECT setval('teachers_id_seq', (SELECT MAX(id) FROM teachers));
SELECT setval('subjects_id_seq', (SELECT MAX(id) FROM subjects));
SELECT setval('student_group_id_seq', (SELECT MAX(id) FROM student_group));
SELECT setval('lessons_id_seq', (SELECT MAX(id) FROM lessons));

COMMIT;